# SQL Review with Pagila data

### Introduction

In this lesson, we will work with the pagila database.

### Getting Setup

Load our data with the following.

In [ ]:
import os
data_dir = './csv_data'
datasets = os.listdir(data_dir)

import pandas as pd
dataframes = {}
for dataset in datasets:
    df = pd.read_csv(f'{data_dir}/{dataset}')
    table_name = dataset.replace('.csv', '')
    dataframes[table_name] = df

Then create a new database by running the following in the command line.

In [1]:
# psql -c "create database pagila_db;"

And we can then connect to our database like so.

In [1]:
from sqlalchemy import create_engine
engine = create_engine('postgresql+psycopg2://@localhost/pagila_db')

And then we can use pandas to load data into our tables.

In [ ]:
for table_name, dataframe in dataframes.items():
    dataframe.to_sql(table_name, engine, if_exists = 'replace')

In [33]:
import pandas as pd
pd.read_sql('select * from actor limit 2', engine)

   actor_id first_name last_name               last_update
0         1   PENELOPE   GUINESS 2022-02-15 09:34:33+00:00
1         2       NICK  WAHLBERG 2022-02-15 09:34:33+00:00

### Problems

* Find the revenue result from each of the film ratings, order by he amount of revenue earned.

> By revenue, this can be derived from the `amount` attribute, which is located in the `payment` table.

In [42]:
query = """"""

pd.read_sql(query, engine)

# 	rating	total_amount
# 0	PG-13	15259.16
# 1	NC-17	13885.02
# 2	PG	13337.91
# 3	R	13270.19
# 4	G	11664.23

  rating  total_amount
0  PG-13      15259.16
1  NC-17      13885.02
2     PG      13337.91
3      R      13270.19
4      G      11664.23

* Find the film rented the most number of times by a single customer.  If there is a tie, show all tying customers and films.

In [13]:
query = """
"""
pd.read_sql(query, engine)

# irst_name	last_name	title	amount_rentals
# 0	GEORGE	LINTON	CADDYSHACK JEDI	3
# 1	THELMA	MURRAY	DISCIPLE MOTHER	3
# 2	RANDY	GAITHER	DETECTIVE VISION	3
# 3	EDWARD	BAUGH	FLATLINERS KILLER	3

  first_name last_name              title  amount_rentals
0     GEORGE    LINTON    CADDYSHACK JEDI               3
1     THELMA    MURRAY    DISCIPLE MOTHER               3
2      RANDY   GAITHER   DETECTIVE VISION               3
3     EDWARD     BAUGH  FLATLINERS KILLER               3

* Find the movie title of the actor whose movies were rented the most number of times, order by the title name in ascending order.

In [63]:
query = """
"""

pd.read_sql(query, engine)

   film_id                title
0       62         BED HIGHBALL
1      112    CALENDAR GUNFIGHT
2      133      CHAMBER ITALIAN
3      136      CHAPLIN LICENSE
4      138  CHARIOTS CONSPIRACY

Find the name of the actor whose movies have been rented the most, and return the number of rentals along with the actor's first and last name.

In [28]:
query = """
"""

pd.read_sql(query, engine)

   actor_id first_name  last_name  total
0       107       GINA  DEGENERES    753

* Find a running total of payment ordered by the payment amount and the payment_id.  Limit to the first five records.

In [9]:

query = """ """
pd.read_sql(query, engine)

# payment_id	amount	sum
# 0	29136	11.99	11.99
# 1	28814	11.99	23.98
# 2	28799	11.99	35.97
# 3	24866	11.99	47.96
# 4	24553	11.99	59.95

   payment_id  amount    sum
0       29136   11.99  11.99
1       28814   11.99  23.98
2       28799   11.99  35.97
3       24866   11.99  47.96
4       24553   11.99  59.95

* Find the film release year that had the largest change in average length from the year before, and show that year and that largest difference.

In [40]:
query = """
"""
pd.read_sql(query, engine)

# 	release_year	lag_diff
# 0	2012	41.616667

   release_year   lag_diff
0          2012 -41.616667